object Generation {

    const val GROUPS = 20
    const val STUDENTS = 600
    const val STUDENT_SETS = 60
    const val TEACHERS = 20
    const val ACTIVITIES = 30
    const val SCHOOLS = 4
    const val PLANS = 6
    const val PLAN_TASKS = 60

    val DEFAULT_SCHOOL_NAMES = listOf(
        "Высшая школа инженерной педагогики, психологии и прикладной лингвистики",
        "Высшая школа лингводидактики и перевода",
        "Высшая школа медиакоммуникаций и связей с общественностью",
        "Высшая школа международных отношений",
        "Высшая школа юриспруденции и судебно-технической экспертизы",
        "Высшая школа гидротехнического и энергетического строительства",
        "Высшая школа промышленно-гражданского и дорожного строительства",
        "Высшая школа биомедицинских систем и технологий",
        "Высшая школа биотехнологий и пищевых производств",
        "Высшая школа киберфизических систем и управления",
        "Высшая школа программной инженерии",
        "Высшая школа интеллектуальных систем и суперкомпьютерных технологий",
        "Высшая школа автоматизации и робототехники",
        "Высшая школа креативной индустрии и дизайна",
        "Высшая школа машиностроения",
        "Высшая школа транспорта",
        "Высшая школа физики и технологий материалов"
    )

    val SUBJECTS = listOf(
        "Физика",
        "Высшая математика",
        "Основы программирования",
        "Культура речи",
        "Философия",
        "Низкоуровневое программирование",
        "Квантовая физика",
        "Нейронные сети",
        "Микропроцессоры",
        "Безопасность жизнедеятельности",
        "Тестирование",
        "Высоконагруженные системы",
        "Химия",
        "Теоретическая механика"
    )

    val ACTIVITY_TYPES = listOf(
        "Лекции",
        "Курс. работа",
        "Практика",
        "Лабораторные"
    )

    val TRAINING_SPEC = listOf(
        "02.03.02",
        "02.03.03",
        "09.03.01",
        "09.03.02",
        "09.03.03",
        "09.03.04",
        "27.03.02",
        "27.03.03",
        "27.03.04",
        "27.03.05",
        "02.04.02",
        "02.04.03",
        "09.04.01",
        "09.04.02",
        "09.04.03",
        "09.04.04",
        "27.04.03",
        "27.04.04",
        "27.04.05",
        "09.06.01",
        "12.06.01",
        "27.06.01"
    )

    val TRAINING_SUBSPEC = listOf(
        "01",
        "02",
        "03",
        "04"
    )

}
