object Generation {

    const val GROUPS = 10
    const val STUDENTS = 300
    const val STUDENT_SETS = 30
    const val TEACHERS = 10
    const val ACTIVITIES = 30
    const val SCHOOLS = 4
    const val PLANS = 5
    const val PLAN_TASKS = 50

    val DEFAULT_SCHOOL_NAMES = listOf(
        "Высшая школа инженерной педагогики, психологии и прикладной лингвистики",
        "Высшая школа лингводидактики и перевода",
        "Высшая школа медиакоммуникаций и связей с общественностью",
        "Высшая школа международных отношений",
        "Высшая школа юриспруденции и судебно-технической экспертизы",
        "Высшая школа гидротехнического и энергетического строительства",
        "Высшая школа промышленно-гражданского и дорожного строительства",
        "Высшая школа биомедицинских систем и технологий",
        "Высшая школа биотехнологий и пищевых производств",
        "Высшая школа киберфизических систем и управления",
        "Высшая школа программной инженерии",
        "Высшая школа интеллектуальных систем и суперкомпьютерных технологий",
        "Высшая школа автоматизации и робототехники",
        "Высшая школа креативной индустрии и дизайна",
        "Высшая школа машиностроения",
        "Высшая школа транспорта",
        "Высшая школа физики и технологий материалов"
    )

    val SUBJECTS = listOf(
        "Физика",
        "Высшая математика",
        "Основы программирования",
        "Культура речи",
        "Философия",
        "Низкоуровневое программирование",
        "Квантовая физика",
        "Нейронные сети",
        "Микропроцессоры",
        "Безопасность жизнедеятельности",
        "Тестирование",
        "Высоконагруженные системы",
        "Химия",
        "Теоретическая механика"
    )

    val ACTIVITY_TYPES = listOf(
        "Лекции",
        "Курс. работа",
        "Практика",
        "Лабораторные"
    )

}